# Задача 2. Вариант 38.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Гераклит. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Kucheryavenko A. I.
# 17.03.2016

print("Всё течет, всё меняется.Нельзя дважды войти в одну и ту же реку.")

print("\n\t\t\t\t\t\t\tГераклит")

input("\n\nНажмите Enter для выхода.")

