# Задача 1. Вариант 38.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Аврора Жюпен. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Kucheryavenko A. I.
# 17.03.2016

print("Жорж Санд более известна, как французская писательница Амандина Аврора Люсиль Дюпен.")

input("\n\nНажмите Enter для выхода.")
