#Задача 3. Вариант 48
#Напишите программу, которая выводит имя "Борис Николаевич Кампов", и
#запрашивает его псевдоним. Программа должна сцеплять две эти строки и
#выводить полученную строку, разделяя имя и псевдоним с помощью тире.

#Generalov K. A.

print("Борис Николаевич Кампов")
a = "Под каким же именем мы знаем этого человека?"
input(a + 'Ваш ответ: ')
print("Все верно: Борис Николаевич Кампов - Борис Полевой")
input("\n\nНажмите Enter для выхода.")
