#Задача 2. Вариант 48
#Напишите программу, которая будет выводить на экран наиболее понравившееся
#вам высказывание, автором которого является Софокл. Не забудьте о том, что
#автор должен быть упомянут на отдельной строке.

#Generalov K. A.

print("Отвергнуть друга преданного - значит лишиться драгоценнейшего в жизни.")
print("\n                                                      Софокл")
input("\n\nНажмите Enter для завершения")
