# Задача 3. Вариант 10
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Юстиниан. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Кишуков Назир
# 30.02.2016

print ("Под каким псевдонимом наиболее известен Игорь Васильевич Лотарев?")
answer = input ("Ваш ответ: ")
print ("Верно:Игорь Васильевич Лотарев - "+answer)

input("\nДля выхода нажмите Enter")
