# Задача 1. Вариант 10
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Ричард Дженкинс. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Кишуков Назир
# 28.02.2016

print ("Ричард Дженкинс американский актер кино,театра и телевидения ,псевдоним под которым он скрывался Ричард Бертон")

input ("Нажмите Enter для выхода.")
