# Задача 2. Вариант 10
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Юстиниан. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Кишуков Назир
# 29.02.2016



print ("И не судите о том, что является лучшим и более справедливым, по большинству авторитетов: ибо мнение одного и худшего может превосходить в каком-либо вопросе многих и более высоких...")
print ("\t\t\t\t\t\tЮстиниан I\n")

input ("Нажмите Enter для выхода.")
