# Задача 2. Вариант 14.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Конфуций. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Kolov A.A
# 16.04.2016


print("Единственная настоящая ошибка - не исправлять своих прошлых ошибок.")
input("															  Конфуций")