# Задача 2. Вариант 49
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, # автором которого является Аристотель. Не забудьте о том, что автор должен быть упомянут на # отдельной строке.

# Ametova M. M.
# 31.03.2016


print("Великодушного человека отличает то, что он не ищет выгоды для себя, но с готовностью делает добро другим. (с)"
      "\nАристотель")
input("\n\nНажмите Enter для выхода.")