# Задача 1. Вариант 49
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым # скрывается Эжен Грендель. После вывода информации программа должна дожидаться пока # пользователь нажмет Enter для выхода.

# Ametova M. M.
# 31.03.2016

print("Эжен Грендель более известен, как французский поэт Поль Элюар.")

input("\n\nНажмите Enter для выхода.")
