# Задача 1, Вариант 12
# Напишите программу , которая будет сообщать род деятельности и псевдоним	под которым	скрывается Мария Луиза Чеччарелли.	
# Послевывода информации программа	должна	дожидаться	пока пользователь нажмет Enter	для	выхода.

# Лях А. А.
# 21.05.2016
print("Мария Луиза Чечарелли, более известна как итальянская актриса  Моника Витти.\n\n")
input("Нажмите Enter для выхода.")
