# Задача 2, Вариант 12
# Напишите	программу ,	которая	будет выводить	на	экран наиболее	понравившееся вам	высказывание, автором	которого	является	Анвари.	Не	забудь те	о	том,	что
# автор	должен быть	упомянут на	отдельной строке.

# Лях А. А.
# 21.05.2016
print ("Лизоблюдов продажных не считай за людей..\n" + "\t\t\t\t\t\t  Аухад Анвари")
input("Нажмите Enter для выхода.")