#Задача 2. Вариант 17.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Ас-Cамарканди. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Orshonova. E. G.
#23.05.2016
print ("Если болезнь не определена, невозможно и лечить ее. Если дать противоядия сверх меры, То подействует оно вредней, чем яд.")
print ("\t\t\t\tАс-Самарканди Мухаммед ибн Али")
input ("\nНажмите enter для выхода")