#Задача 1. Вариант 17.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Алексей Максимович Пешков. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Orshonova. E. G.
#23.05.2016
print ("Алексей Максимович Пешков-литературный псевдоним Максима Горького.Русский писатель, прозаик, драматург. Один из самых значительных и известных в мире русских писателей и мыслителей.")
input("\n\nНажмите Enter для выхода")