#Задача 3. Вариант 17.
#Напишите программу, которая выводит имя "Симона Руссель", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

#Orshonova. E. G.
#23.05.2016
print("Сегодня речь пойдёт про Симона Руссель")
print("Под каким именем мы знаем этого человека?"); print("Ваш ответ: Мишель Морган")
print("Всё верно: Симона Руссель - Мишель Морган")
input('\nНажмите Enter для выхода')