# Задача № 4. Вариант 28
# Напишите программу, которая выводит имя, под которым скрывается Эдуард Георгиевич Зюбин. 

# Цкипуришвили Алекандр
#25. 05. 2016
print("Эдуард Георгиевич Зюбин-Псевдоним Эдуард Георгиевич Багрицкий")
print("Русский поэт, переводчик и драматург")
print("Эдуард Багрицкий родился в Одессе в еврейской семье")
A=1895
B=1934
C=B-A
print("Родился в "+ str(A)+ ",а умер в" +str(B)+ "году")

print("На момент смерти Эдуард Георгиевич было "+ str(C-1)+" года")

input("Чтобы закрыть нажмите Enter")