#Задача № 3. Вариант 28
# Программа вводит имя и запрашивает его псевдоним

# Цкипуришвили Александр 
#25.05.2016

print("Анри Мари Бейль \nПод каким псевданимом он был известен?")
psev=input("Ваш ответ:")
if (psev)==("Стендаль"):
 	print("Все верно! Анри Мари Бейль-Стендаль  - " + psev)
 	input("\n\n\nНажмите Enter для завершения")

 	exit
else:
 	print("Неверно!")
 	input("\n\n\nНажмите Enter для завершения")

 