# Задача 2. Вариант 28. 
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Эпикур. Не забудьте о том, что автор должен быть упомянут на отдельной строке. 


# Цкипуришвили Александр 
# 25.05.2016 
print("Каждый уходит из жизни так, словно только что вошел.") 
print("\n\t\t\t\t\t Эпикур") 
input("нажимте Enter для выхода")