# Задача 1. Вариант 0.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Эдсон Арантис ду Насименту. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Krasnikov A. S.
# Цкипуришвили Александр
# 01.02.2016





print("Норма Бейкер более известена, как Американская киноактриса, певица и секс-символ Мэрилин Монро.")
input("\n\nНажмите Enter для выхода.")