#Задача №4, Вариант 7
#Программа выводит имя, которое скрывается под псевдонимом и дополнительно выводит область интересов, место и год рождения, а также возраст. Данные хранятся в переменных.

#Ворошин С.И.
#14.03.2016



print("Мария Луиза Чеччарелли более известна, как итальянская актриса Моника Витти.")
born=1931
place="Рим, Италия"
age=2016-born
interes="Кино"
print("Место рождения: "+(place))
print("Год рождения: "+str(born))
print("Возраст: "+str(age))
print("Область интересов: "+(interes))
input("Нажмите Enter для выхода.")
