
# Задача 1. Вариант 44.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым
# скрывается Александр Михайлович Гликберг. После вывода информации программа должна дожидаться
# пока пользователь нажмет Enter для выхода.
# Golubev A. S.
# 31.03.2016

print("Александр Михайлович Гликберг более известен, как Саша Чёрный - русский поэт Серебряного века.")

input("\n\nНажмите Enter для выхода.")
