# Задача 2. Вариант 44.
# Напишите программу, которая будет выводить на экран наиболее 
# понравившееся вам высказывание, автором которого является Эразм Роттердамский. 
# Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Golubev A. S.
# 31.03.2016

print("Вежливость порождает и вызывает вежливость.")

print("\n\t\t\t\t\tЭразм Роттердамский")

input("\n\nНажмите Enter для выхода.")
