# Задача 2. Вариант 11
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Анвари. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Курчатов Н.В
# 14.03.2016
print("Каждый доллар в чужом кармане он воспринимал как личное для себя оскорбление.")
print("\t О'Генри")
input ("Нажмите Enter для выхода")
