# Задача 3. Вариант 11
# Напишите программу, которая выводит имя "Анна Андреевна Горенко", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
# Курчатов Н.В
# 14.03.2016
name=" Анна Андреевна Горенко"
print("Герой нашей сегодняшней программы - "+name)
print(" Под каким именем мы знаем этого человека? Ваш ответ:")
out=input()
print("Все верно! Псевдоним этого человека - "+out)
input ("Нажмите Enter для выхода")
