# Задача 1. Вариант 21.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Михаил Николаевич Румянцев. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Molokanov I. A.
# 17.03.2016

print("Михаил Николаевич Румянцев более известен, как советский артист цирка (клоун) - Карандаш.")

input("\n\nНажмите Enter для выхода.")