# Задача 4. Вариант.21
# Напишите программу, которая выводит имя, под которым скрывается Филип Ауреол Теофраст Бомбаст фон Гогенгейм. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Molokanov I.A.
# 28.04.2016

print("Филип Ауреол Теофраст Бомбаст фон Гогенгейм более известен, \nкак прославленный врач и естествоиспытатель, один из основателей ятрохимии, \nнатурфилософ и алхимик эпохи Возрождения - Парацельс.")
a=input("\nМесто рождения: Эйнзидельн, кантон Швиц, Швейцарский союз. \nНажмите Enter для продолжения")
b=input("\nГод рождения: 1493. \nНажмите Enter для продолжения")
c=input("\nВозраст на момент смерти: 48 лет. \nНажмите Enter для продолжения")
d=input("\nОбласть интересов: медицина, алхимия, астрология. \nНажмите Enter для продолжения")
print(a,b,c,d)
input("Нажмите Enter для выхода")