# Задача 3. Вариант 21.
# Напишите программу, которая выводит имя "Аркадий Петрович Голиков", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Molokanov I.A.
# 14.04.2016

print("Герой нашей сегоднящней программы - Аркадий Петрович Голиков")
print("Под каким же именем мы знаем этого человека?")
input("\n\nВаш ответ: ")
print("\nВсе верно: Аркадий Петрович Голиков - Гайдар, Аркадий Петрович")
input("\nНажмите Enter для продолжения")