#Напишите программу, которая выводит имя "Мари Фрасуа Аруэ",
#и запрашивает его псевдоним. Программа должна сцеплять две эти
#строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

#Zabolotnova D.K.
#25.03.16

print("Герой нашей сегодняшней программы Мари Фрасуа Аруэ.")
P=input ("Под каким псевдонимом мы занем этого человека? Ваш ответ:")
if P=="Вольтер":
      print("Всё верно:Мари Фрасуа Аруэ- Вольтер")
else:
      print('Нет. Подумайте ещё!')

input('Чтобы закрыть нажмите Enter')
