# Задача 3. Вариант 49.
#Напишите программу, которая выводит имя "Алексей Максимович Пешков", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
#Valkovskey M.A.
print('Герой нашей сегодняшней программы - Алексей Максимович Пешков')
name = input('Под каким именем мы знаем этого человека? Ваш ответ:')
print(name)
print('Всё верно:Алексей Максимович Пешков - Максим Горький')
print('\nНажмите Enter для завершения программы')
input()
