# Задача 5. Вариант 49.
#Напишите программу, которая бы при запуске случайным образом отображала название одного из девяти действующих вокзалов Москвы.
#Valkovskey M.A.
import random
x=random.choice(["Белорусский вокзал", "Казанский вокзал", "Киевский вокзал", "Курский вокзал" , "Ленинградский вокзал", "Павелецкий вокзал", "Рижский вокзал", "Савёловский вокзал", "Ярославский вокзал"])
print ("Программа случайным образом отображает название одного из девяти действующих вокзалов Москвы.")
print (x)

input("\n\nНажмите Enter для выхода.")
