# Задача 4. Вариант 49.
#Напишите программу, которая выводит имя, под которым скрывается Саид-Мурадзола Садриддин. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Valkovskey M.A.
print("Садриддин Саид-Мурадзола, как Таджикский писатель и ученый Айни ")
birth="село Сактар,Гиждуванский район Бухарской области"
date="1878"
age="63"
death="1954"
area="Литература и наука"
print("Место рождения: ", birth)
print("Год рождения: ", date)
print("Возраст: ", age)
print("Дата смерти: ", death)
print("Область интересов: ", area)

input("\n\nНажмите Enter для выхода.")
