# Задача 2. Вариант 49.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Аристотель. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
#Valkovskey M.A.
print('Опьянение показывает душу человека, как зеркало отражает его тело.\n')
print('%+70s' % 'Эсхин\n')
print('Нажмите Enter для завершения программы')
input()
