# Задача 1. Вариант 49.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Эжен Грендель. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Valkovskey M.A.
print('Эжен Эмиль Поль Грендель - французский поэт, выпустивший более сотни поэтических сборников\n\n')
print('Нажмите Enter для завершения программы')
input()
