# Задача 1, Вариант 14 
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Мари Фрасуа Аруэ. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Моренко А.А.
# 07.03.2016

print("Мари Франсуа Аруэ, – великий французский писатель, поэт, драматург, философ-просветитель, более известный как Вольтер.")
Input("Нажмите Enter для выхода")