# Задача 3. Вариант 12
#
#Напишите программу, которая выводит имя "Тициано Вечеллио", и запрашивает его псевдоним.
#Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
# Курятников П.В
# 25.05.2016

a ="Titsiano Vechello"
b ="-"
c="Titsian"
print(a+b+c)
input("type 'enter'")
