# Задача 2. Вариант 12
#
#Напишите программу, которая будет выводить на экран
#наиболее понравившееся вам высказывание, автором которого является Анвари.
#Не забудьте о том, что автор должен быть упомянут на отдельной строке.
#
#
a= "Друг - зеркало для друга, нет зеркала светлей!"
print (a)
b= " \tАнвари"
print(b)
input("Нажмите enter")
# Курятников П.В
# 25.05.2016 
