# Задача 1. Вариант 12

# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Мария Луиза Чеччарелли. После вывода информации
# программа должна дожидаться пока пользователь нажмет Enter для выхода.
#
# Курятников П.В.
# 23.05.2016 


print("Monika Vitti - famous italian actress")
input ("Write enter")

