# Задача 1. Вариант 2.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Мартин Андерсен. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Andros D.A.
#17.03.2016


print("Мартин Андерсен носит псевдоним Нексё, известный датский писатель-коммунист")
input("\n\nНажмите Enter для выхода.")