# Задача 4.Вариант 2.
# Напишите программу, которая выводит имя, под которым скрывается Михаил Евграфович Салтыков. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Andros D.A.
# 14.04.2016

print('Михаил Евграфович Салтыков-Щедрин известен,как русский писатель,журналист,редактор журнала "Отечественные записки",Рязанский и Тверской вице-губернатор.')
name=input("Место рождения:село Спас-Угол,Калязинский уезд,Тверская губерния")
a=input("Год рождения:1826")
b=input("Возраст:на момент смерти 63")
c=input("Область интересов: литература,журналистика")

input("Нажмите Enter для выхода")

