# Задача 1. Вариант 50.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Герхард Герхардс. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Andros D.A.
# 17.03.2016

print("Герхардс Герхард имеет псевдоним Эразм Роттердамский,Один из наиболее выдающихся гуманистов")

input("\n\nНажмите Enter для выхода.")