# Задача 5.Вариант 2.
# Напишите программу, которая бы при запуске случайным образом отображала имя одного из трех поросят.
# Andros D.A.
# 14.04.2016

import random
pigs=["Naf-Naf","Nuf-Nuf","Nif-Nif"]
p=random.choice(pigs)
print(p)
