# Задача 3. Вариант 2.
# Напишите программу, которая выводит имя "Мария Луиза Чеччарелли", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Andros D.A.
# 31.03.2016


print("Герой нашей сегодняшней программы-Мария Луиза Чеччарелли")
print("Введите настоящее имя этого человека")
name=input("Ваш ответ: ")
print("Все верно:Мария Луиза Чеччарелли-Моника Витти")
input("Нажмите Enter")

