# Задача 1 Вариант 35
# Текст задачи Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Янис Плиекшанс. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Машаева Ангелина Юрьевна
# 26.02.2016

print("Ян Райнис-латышский поэт, драматург, переводчик, политик, общественный деятель, народный поэт Латвийской ССР")

input("нажмите enter")
