# Задача 2 Вариант 35
# Текст задачи Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Пифагор. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Машаева Ангелина Юрьевна
# 26.02.2016

print("Все исследуй, давай разуму первое место.")
print("\t\t\t\t\t\t\t\t\t\t\t\t\t\tПифагор")

input("нажмите enter для выхода")
