# Задача №1.Вариант 6.
# Комрьютер пишет род деятельности и псевдоним Йоханнеса Бруфельдта

# Борщёва В.О.
# 29.02.2016
print ("Юхани Ахо(\"литературный псевдоним Йоханнеса Бруфельдта)-финский писатель, журналист, переводчик.")
input (Нажмите Enter для выхода)

