# Задача4. Вариант 6
#Компьютер выводит имя, под которым скрывается София Шиколоне,выводит область интересов, место рождения, годы рождения и смерти.

#Борщёва В.О
#14.03.2016

print ("София Шиколоне известна, как итальянская актриса и певица Софи Лорен.")
born= 1934
years= 2016- born
place="Рим, Италия"
interes= "кино"
print("Место рождения: "+(place))
print (" Год рождения:"+str(born))
print("Возраст:"+str(years))
print("Область интересов:"+(interes))
input("Нажмите enter для выхода")
