#Задача №3. Вариант 6
#Программа выводит имя Самюэл Ленгхорн Клеменс и запрашивает его псевдоним
#Борщёва В.О
#29.02.2016
print("Герой нашей сегодняшней программы-Самюэл Ленгхорн Клеменс")
psev=input("Под каким же именем мы зтого человека? Ваш ответ:")
if(psev)==(Марк Твен):
print(Все верно:Самюэл Ленгхорн Клеменс-"+psev)
else:
print("Вы ошиблись. это ни его псевдоним.")
input("Нажмите Enter для выхода ")