#Задача №3. Вариант 6

#Борщёва В.О
#02.03.2016
                                                                                                                             print("Герой нашей сегодняшней программы-Самюэл Ленгхорн Клеменс")
psev=input("Под каким же именем мы зтого человека? Ваш ответ:")
if(psev)==(Марк Твен):
print(Все верно:Самюэл Ленгхорн Клеменс-"+psev)
else:
print("Вы ошиблись. это ни его псевдоним.")
input("Нажмите Enter для выхода ")
