# Задача 1. Вариант 8
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым
# скрывается Ефим Алексеевич Придворов. После вывода информации программа
# должна дожидаться пока пользователь нажмет Enter для выхода.

# Egorov V. I.
# 23.02.2016

print("Ефим Алексеевич Придворов, более известный как советский писатель Демьян Бедный.\n\n")
input("Нажмите Enter для выхода.")
