# Задача 2. Вариант 8
# Напишите программу, которая будет выводить на экран наиболее
# понравившееся вам высказывание, автором которого является Лао-Цзы.
# Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Egorov V. I.
# 24.02.2016

print("Будьте внимательны к своим мыслям, они — начало поступков."
      "\nЛао-Цзы")
input("\n\nНажмите Enter для выхода.")
