#Задача №1. Вариант 34. 
# Напишите программу, которая будет сообщать род деятельности и псевдоним под 
#которым скрывается Борис Николаевич Кампов. После вывода информации 
#pрограмма должна дожидаться пока пользователь нажмет Enter для выхода. 

# Novikova J. V. 
# 07.04.2016 

print("Борис Николаевич Кампов более известен, как советский писатель Полевой Борис Николаевич.") 

input("\n\nНажмите Enter для выхода.")