#Задача №4. Вариант 34. 
#Напишите программу, которая выводит имя, под которым скрывается Мария Луиза Полякова — Байдарова. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода 

#Novikova J. V. 
#26.04.2016 

print('Мария Луиза Полякова — Байдарова, французская актриса, более известна как Влади Марина') 
place='Клиши, Франция' 
born='1938' 
age='78' 
interes='Кино' 
print('Место рождения: '+place) 
print('Год рождения: '+str(born)) 
print('Умерла в возрасте: '+str(age)) 
print('Область интересов: '+interes) 
input('Нажмите Enter для выхода')