#Задача №7 Вариант 34 
#Создайте игру, в которой компьютер загадывает имя одного из трех племянников Скруджа МакДака, а игрок должен его угадать.

#Novikova J. V. 
#05.05.2016
import random 
print("Назовите имя одного из трех племянников Скруджа МакДака.")
name =  ("Вилли", "Билли", "Дилли")