#Задача №2. Вариант 34. 
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Платон. Не забудьте о том, что автор должен быть упомянут на отдельной строке. 


# Novikova J. V. 
# 26.04.2016 

print("Музыка воодушевляет весь мир, снабжает душу крыльями, способствует полету воображения.\n" + "\t\t\t\t\t\t Платон") 

input("Нажмите Enter для выхода.")