# Задача 3. Вариант 15.
# Напишите программу, которая выводит имя "Лариса Петровна Косач-Квитка", и запрашивает его псевдоним. 
# Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Mitin D.S.
# 05.03.2016, 23:14.
print('Введите псевдоним Ларисы Петровны "Косач-Квитка": ')
real_name="Лариса Петровна Коcач-Квитка"
answer= input()
print(real_name+" - это "+answer)
input("Намжите Enter для выхода.")