# Задача 2. Вариант 15.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Аркадий Петрович Голиков.
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Mitin D.S.
# 03.03.2016, 17:36.
print("Два основных достояния человеческой природы - это ум и рассуждения.\n\t\t\t\t\t\t\t\tПлутарх")
input("Нажмите ENTER для выхода.")