# Задача 1. Вариант 50
# Напишите программу, которая будет сообщать род деятельности и псевдоним
# под которым скрывается Садриддин Герхард Герхардс.
# После вывода информации программа
# должна дожидаться пока пользователь нажмет Enter для выхода.

# Bronnikov I.S.
# 24.05.2016

print("Герхард Герхардс, более известный как писатель Эразм Роттердамский .\n\n")
input("Нажмите Enter для выхода.")

