# Задача 2. Вариант 50
# Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Иларион (Алфеев) .
# Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Bronnikov I.S.
# 24.05.2016

print("«Нельзя «лезть в душу» человека, ибо душа – это святое святых, и туда можно войти только если вам отворят и пригласят внутрь.""
      "\nИларион (Алфеев)")
input("\n\nНажмите Enter для выхода.")
