Python 3.5.1 (v3.5.1:37a07cee5969, Dec  6 2015, 01:38:48) [MSC v.1900 32 bit (Intel)] on win32
Type "copyright", "credits" or "license()" for more information.
>>> # Задача 1. Вариант 50
# Напишите программу, которая будет сообщать род деятельности и псевдоним
# под которым скрывается Садриддин Герхард Герхардс.
# После вывода информации программа
# должна дожидаться пока пользователь нажмет Enter для выхода.

# Bronnikov I.S.
# 24.05.2016

print("Герхард Герхардс, более известный как писатель Эразм Роттердамский .\n\n")
input("Нажмите Enter для выхода.")

