# Задача 1. Вариант 28.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
#которым скрывается Норма Бейкер.
#После вывода информации программа должна дожидаться
#пока пользователь нажмет Enter для выхода.

# Khvan A.V.
# 10.03.2016


print ("Норма Бейкер более известна, как американская киноактриса и певица \
Мэрилин Монро.")
input ("Для выхода нажмите Enter")
