# Задача 1. Вариант 34
# Напишите программу, которая будет сообщать род деятельности и псевдоним под 
# которым скрывался Борис Николаевич Кампов. После вывода информации 
# программа должна дожидаться пока пользователь нажмёт Enter для выхода. 

# Korsakov A.A.
# 31.03.2016

print ('Борис Николаевич Кампов, более известен как русский советский журналист и прозаик, киносценарист Борис Николаевич Полевой')
input ('Введи Enter для выхода')