# Задача 3. Вариант 14.
# Напишите программу, которая выводит имя "Вильгельм Аполлинарий Костровицкий", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Моренко А.А.
# 07.03.2016

print("Вильгельм Аполлинарий Костровицкий")
psev=input("Введите ее псевдоним:")
print("Вильгельм-"+ psev +" Апполинарий Костровицкий")

input("\n\nНажмите Enter для выхода.")



