# Задача 2, Вариант 12 
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Конфуций. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Моренко А.А.
# 07.03.2016

print("Если ты ненавидишь — значит тебя победили.")
print("                                  Конфуций")

input("\n\nДля выхода нажмите Enter")