# Задача 1. Вариант 25.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается София Шиколоне. 
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
print("Софи Лорен - итальянская певица и актриса. Полное имя - София Виллани Шиколоне.")
input("Нажмите ENTER для выхода.")
# Сердечная Анастасия Михайловна.
# 14,03,2016