#Напишите программу, которая выводит имя "Алессандро Филипели", и запрашивает его псевдоним. 
#Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
print("Введите псевдоним Алессандро ди Мариано ди Ванни Филипепи:")
nick=input()
print("Алессандро ди Мариано ди Ванни Филипепи - это "+nick)
input("Нажмите ENTER для продолжения")