#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Гиппократ. 
#Не забудьте о том, что автор должен быть упомянут на отдельной строке.
print("Душа человека развивается до самой смерти.\n\t\t\t\tГиппократ")
input("Нажмите ENTER для продолжения")