# Задача 1. Вариант 45
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым 
# скрывается Михаил Евграфович Салтыков. После вывода информации программа должна 
# дожидаться пока пользователь нажмет Enter для выхода.

# Burmistrov V. D.
# 03.03.2016

print ("Михаил Евграфович Салтыков, более известный как русский писатель Николай Щедрин.\n\n ")
input("Нажмите Enter для выхода.")