# Задача 2. Вариант 45.
# Напишите программу, которая будет выводить на экран наиболее
# понравившееся вам высказывание, автором которого является Эзоп.
# Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Burmistrov V.D.
# 17.03.2016

print("Если человек берется за два дела, прямо противоположных\
\nдруг другу, одно из них непременно не удастся ему.")

print("\n\t\t\t\t\tЭзоп")

input("\n\nНажмите Enter для выхода.")
