# Задача 1. Вариант 25.
# Текст задачи: Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается София Шиколоне. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Цивунчик Денис Владимирович.
#20.03.16

print("София Шиколоне более известна, как итальянская актриса София Лорен.")

input("\nНажмите Enter для выхода")
