# Задача 1, Вариант 8
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Ефим Алексеевич Придворов. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Карамян Н.Г.
# 29.02.2016

input ('Who is Mr. Efim A. Pridvorov? Press Enter!')
print ('Да это же Демьян Бедный \nпоэт \nпублицист \nи общественный деятель!')


input ('Жмакни Enter, чтобы выйти.')
