# Задача 2, Вариант 8 (без автора)
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Лао-Цзы. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Карамян Н.Г.
# 29.02.2016

input ('Жмакни Enter, чтобы обрести истину!')
print ('Весь мир театр, а у тебя даже билета нет. \nНеизвестный мыслитель')

input ('Жмакни Enter, чтобы потерять истину.')
