#Задача 2, Вариант 21
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Леонардо да Винчи. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Шпенькова А.С.
#14.03.2016

print ('''Истина в конце концов не остается скрытой.
                                     Леонардо да Винчи ''' )
input('\nНажмите Enter для выхода')