# Задача 3. Вариант 31.
# Напишите программу, которая выводит имя "Эмиль Эрзог", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Шемякин А.В.
# 24.5.16
print('Герой нашей сегодняшней программы - Эмиль Эрзог');
print("Все верно: Эмиль Эрзог - " + input("Под каким же именем мы знаем этого человека? Ваш ответ: "));

print("Press Enter to exit");
