# Задача 2. Вариант 31.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Иоанн Златоуст. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Shemyakin A. V.
# 14.03.2016
print ("Лучше хлеб с солью в покое и без печали, чем множество блюд многоценных в печали и горе.");
print ("\t \t \t \t \t \t \t  Иоанн Златоуст");
input ("press 'enter' to exit");
