#Задача №1, Вариант 5
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Анна Андреевна Горенко. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Ермашов А.В.
#26.04.2016
print("Фредерик Аустерлиц -  американский актёр, танцор, хореограф и певец, звезда Голливуда.")
print("Более известен, как Фред Астер.\n\n")
input("Нажмите Enter для выхода.")
