#Напишите программу, которая выводит имя "Жан Батист Поклен", и запрашивает его псевдоним. 
#Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Ермашов А.В., 26.05.2016
name = "Жан-Батист Поклен "
print("Ведите псевдоним Жана-Батиста Поклена: ")
ps = input()
print(name+" - "+ps)
input("Нажмите Enter для выхода")
