#Задача №2, Вариант 5
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Сюнь-цзы. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Ермашов А.В.
#26.04.2016
print("В учении нельзя останавливаться\n\t\t\t\t\t\t\t\tСюнь-цзы")
input("Нажмите ENTER для выхода.")
