#Задача 1. Вариант 2.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Мартин Андерсен. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Григорьев А.О.
#23.05.2016

print("Мартин Андерсен - известный датский писатель-коммунист, один из основателей Коммунистической партии Дании. Последние годы жизни провёл в ГДР")
input("Enter для выхода")
