#Задача 2. Вариант 2.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Эсхин. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Григорьев А.О.
#23.05.2016

print ("Опьянение показывает душу человека, как зеркало отражает его тело.\n" + "\t\t\t\t\t\t Эсхин")
input("Нажмите Enter для выхода.")