# Задача 3. Вариант 25.
# Напишите программу, которая выводит имя "Алессандро Филипели", и запрашивает
# его псевдоним. Программа должна сцеплять две эти строки и выводить полученную
# строку, разделяя имя и псевдоним с помощью тире.
# Цивунчик Денис Владимирович
# 27.05.2012

name=input("Герой нашей программы - Алессандро Филипели.\nПод каким же именем мы знаем этого человека?")
print("Ваш ответ:", name)
print("Все верно: Алессандро Филипели -", name)
input("\n\nНажмите Enter для выхода.")
