# Задача 1. Вариант 25.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается София Шиколоне. После вывода информации программа должна
# дожидаться пока пользователь нажмет Enter для выхода.
# Цивунчик Денис Владимирович
# 27.05.2016

print("София Шиколоне известна под псевдонимом Софи Лорен. Актриса и певица.")
input("\n\nНажмите Enter для выхода.")
