# Задача 2. Вариант 25.
# Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Гиппократ. Не забудьте о том, что
# автор должен быть упомянут на отдельной строке.
# Цивунчик Денис Владимирович
# 27.05.2016

print("Сгорая сам, свети другим.")
print("\n\t\tГиппократ")
input("\n\nНажмите Enter для выхода.")
