#Задача 1. Вариант 44.

#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Александр Михайлович Гликберг. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода


#Zabolotnova D.K.
#23.02.2016

print ("Александр Михайлович Гликберг- русский поэт Серебряного века, прозаик, получивший широкую известность как автор популярных лирико-сатирических стихотворных фельетонов. Скрывался под псевдонимом 'Саша Чёрный' ")


input ("Нажмите Enter , чтобы закрыть")
