#Задача 2. Вариант 44.

#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Эразм Роттердамский. Не забудьте о том, что автор должен быть упомянут на отдельной строке


#Zabolotnova D.K.
#23.02.2016

print ("Нет ничего отважнее, чем победа над самим собой... ")

print ( "\n\t\t\t Эразм Pоттердамский")
input ("\nНажмите Enter , чтобы закрыть")
