# Задача 2. Вариант 6.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Иисус Христос. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Velyan A. S.
# 27.05.2016

print("Не убивай; не прелюбодействуй; не кради; не лжесвидетельствуй; почитай отца и мать; и: люби ближнего твоего, как самого себя.")

print("\n                                                                                                              Иисус Христос")
input("Нажмите Enter для выхода.")