# Задача 4. Вариант 6.
# Напишите программу, которая выводит имя, под которым скрывается София Шиколоне. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Velyan A. S.
# 27.05.2016

print('София Шиколон более известена, как итальянская актриса и певица София Виллани Шиколоне.')
name=input("Место рождения: Поццуоли, Рим")
a=input("Год рождения: 1934")
b=input("Возрастy на данный момент: 81")
c=input("Область интересов: актриса")

input("\nДля выхода нажмите Enter") 