# Задача 1. Вариант 6.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Йоханнес Бруфельдт. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Velyan A. S.
# 27.05.2016

print("Йоханнес Бруфельдт более известен, как финский писатель, журналист, переводчик - Юхани Ахо")

input("\n\nНажмите Enter для выхода.")