# Задача 3. Вариант 6.
# Напишите программу, которая выводит имя "Самюэл Ленгхорн Клеменс", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Velyan A. S.
# 27.05.2016

print("Герой нашей сегодняшней программы - Сэмюэл Ленгхорн Клеменс")
print("Под каким же именем мы знаем этого человека?")
input("\n\nВаш ответ: Марк Твен")
print("\nВсе верно: Самюэл Ленгхорн Клеменс - Марк Твен")
input("\nНажмите Enter для выхода")