#Задача 4. Вариант 24
#Напишите программу, которая выводит имя, под которым скрывается Ефим Алексеевич Придворов. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Semyenov A.N.
#21.03.2016
print("Ефим Алексеевич Придворов более известен, как русский советский писатель, поэт и общественный деятель Демьян Бедный")
m = 'Губовка, Александрийский уезд, Херсонская губерния'
g = 1883
d = 1945
v = 62
o = 'Социалистический реализм'
print("Место рождения: " + m)
print("Год рождения: ", g)
print("Год сммерти: ", d)
print("Возраст: ", v)
print("Область интересов: " + o)
input("\nНажмите Enter для выхода")