#Задача 3. Вариант 24
#Напишите программу, которая выводит имя "Максимилиан Гольдман", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

#Semyenov A.N.Ы
#08.03.2016
print("Сегодня речь пойдёт про Максимилиана Гольдмана")
print("Под каким именем мы знаем этого человека?"); print("Ваш ответ: Макс Рейнхардт")
print("Всё верно: Максимилиан Гольдман - Макс Рейнхардт")
input('\nНажмите Enter для выхода')