#Задача 2. Вариант 24
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Иоанн (Алексеев). Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Semyenov A.N.
#23.02.2016
print("<<Самомнение и тщеславие – они-то не дают видеть себя, какой ты есть в сущности.>>")
print("\t\t\tИоанн")
input('\n\nНажмите Enter для выхода')