#Задача 1. Вариант 24
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Джон Гриффит Лондон. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Semyenov A.N.
#09.02.2016
print("Джон Гриффит Лондон более известена, как американский писатель, социалист Джек Лондон")
input('\nНажмите Enter для выхода')