# Задача 1. Вариант 20.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Евгений Петрович Катаев. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Рожко Ксения
# 23.05.2016





print("Евгений Петрович Петров (настоящая фамилия Катаев) родился в Одессе в семье учителя истории")
input("\n\nНажмите Enter для выхода.")