#Задача 3. Вариант 1.
#Напишите программу, которая выводит имя "Иво Ливи", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
name=input('Герой нашей сегодняшней программы - Иво Ливи. \nПод каким же именем мы знаем этого человека? ')
print('Ваш ответ: ', name)
print('Все верно: Иво Ливи - ', name)
input('Нажмите Enter')
#Abdrahmanova G. I.
#7.03.2016