#Задача 2. Вариант 1.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Еврипид. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
print('Лишь ласковый имеет дар пленять. \n\t\t\tЕврипид')
input('Нажмите Enter')
#Abdrahmanova G. I.
#29.02.2016