#Задача 5. Вариант 1.
#Напишите программу, которая бы при запуске случайным образом отображала название одного из семи чудес света.
import random
wonder=random.choice(["Пирамиды Гизы", "Висячие сады Семирамиды", "Олимпийская статуя Зевса", "Храм Артемиды в Эфесе", "Галикарнасский мавзолей", "Колосс Родосский", "Александрийский маяк"])
print("Программа вывела: ", wonder)
input('Нажмите Enter')
#Abdrahmanova G. I.
#21.03.2016