#Задача 4. Вариант 1.
#Напишите программу, которая выводит имя, под которым скрывается Иво Ливи. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
name="Ив Монтан"
born=1921
died=1991
city="Италия, г. Монсуммано-Терме"
hobby="Эстрада"
print('Иво Ливи более известен, как французский певец-шансонье и актёр ', name)
print('Место рождения: ', city)
print('Год рождения: ', born)
print('Год смерти: ', died)
print('Возраст на момент смерти: ', died-born)
print('Область интересов: ', hobby)
input('Нажмите Enter')
#Abdrahmanova G. I.
#14.03.2016