#Задача 1. Вариант 1.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Саид-Мурадзола Садриддин. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
print('Саид-Мурадзола Садриддин - таджикский писатель,ученый, общественный деятель. \nБолее известен под псевдонимом Айни.')
input('Нажмите Enter')
#Abdrahmanova G. I.
#22.02.2016