#Задача 4. Вариант 19
#Напишите программу, которая выводит имя, под которым скрывается Ричард Дженкинс. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Primov G. S.
#21.02.2016
print("Ричард Дженкинс более известен, как американский актёр Дейл")
m = 'Де-Калб, Иллинойс, США'
g = 1947
v = 68
o = 'Кино'
print("Место рождения: " + m)
print("Год рождения: ", g)
print("Возраст: ", v)
print("Область интересов: " + o)
input("\n\nНажмите Enter")