#Задача 1. Вариант 19
#Напишите программу, которая выводит имя "Михаил Николаевич Румянцев", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

#Primov G. S.
#08.03.2016
print("Сегодня речь пойдёт про Михаила Николаевича Румянцева")
print("Под каким именем мы знаем этого человека?"); print("Ваш ответ: Карандаш")
print("Всё верно: Михаил Николаевич Румянцев - Карандаш")
input('\n\nНажмите Enter')