#Задача 1. Вариант 19
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Илья Арнольдович Файзильберг. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Primov G. S.
#09.02.2016
print("Илья Арнольдович Файзильберг более известен, как русский советский писатель Илья Арнольдович Ильф")
input('\n\nНажмите Enter')