#Задача 1. Вариант 19
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Эсхил. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Primov G. S.
#23.02.2016
print("Страшен брак по принуждению.")
print("\t\t\tЭсхил")

input('\n\nНажмите Enter для выхода')