# Задача 1. Вариант 20.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
#которым скрывается Михаил Ефимович Фрилянд. После вывода информации программа
#должна дожидаться пока пользователь нажмет Enter для выхода.

# Titov I. V.
# 02.06.2016

print ("Михаил Ефимович Фрилянд, более известный  как Мольер - французский комедиограф")
input("\n\nНажмите Enter для выхода.")
