# Задача 2. Вариант 20.
# Напишите программу, которая будет выводить на экран наиболее понравившееся
#вам высказывание, автором которого является Овидий. Не забудьте о том, что
#автор должен быть упомянут на отдельной строке.

# Titov I. V.
# 02.06.2016

print("Происхождение человека есть , по видимому одно из самых случайных явлений.")
print("\t\t\tИнокентий")
input("\n\nНажмите Enter для выхода.")
