#Задача 3. Вариант 24.

#Напишите программу, которая выводит имя "Максимилиан Гольдман", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

#Cheraneva A.S.
#25.03.16

print("Герой нашей сегодняшней программы Максимилиан Гольдман.")
P=input ("Под каким псевдонимом мы занем этого человека? Ваш ответ:")
if P=="Макс Рейнхардт":
      print("Всё верно:Максимилиан Гольдман - Макс Рейнхардт")
else:
      print('Нет. Подумайте ещё!')

input('Чтобы закрыть нажмите Enter')
