#Задача 1. Вариант 24.

#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Джон Гриффит Лондон.
#После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Cheraneva A.S.
#23.02.2016

print ("Джон Гриффит Лондон - американский писатель, автор приключенческих рассказов и романов, более известный как Джек Лондон.")

input ("Нажмите Enter, чтобы закрыть")
