# Задача 1. Вариант 28
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Норма Бейкер. После вывода информации программа должна 
# дожидаться пока пользователь нажмет Enter для выхода.

print("Норма Бейкер, более известная как Мэрилин Монро - американская \nкиноактриса, певица и секс-символ.")
input("\nНажмите Enter для выхода...")