#Задача 1. Вариант 10.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Ричард Дженкинс. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
 
#Donkor А. Х.
#31.03.2016

print("Ричард Дженкинс более известен под псевдонимом Бертон Ричард и является американским киноактером.")

input("\n\n\nНажмите Enter для завершения") 