# Задача 3. Вариант 10. 
# Напишите программу, которая выводит имя "Игорь Васильевич Лотарев", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире. 

# Donkor A.H. 
# 14.04.2016 

print("Итак,гость нынешнего дня является русский поэт - Игорь Васильевич Лотарев")
print("Под каким же псевдонимом мы знаем этого человека?")
input("\n\nВаш ответ: ") 
print("\nВсе верно: Игорь Васильевич Лотарев - Северянин, Игорь Васильевич") 
input("\nНажмите Enter для завершения") 