# Задача 4.Вариант 10.
# Напишите программу, которая выводит имя, под которым скрывается Уильям Сидни Портер. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Donkor A.H.
# 14.04.2016

print('Уильям Сидни Портер - О.Генри известен,как мериканский писатель, прозаик, автор популярных новелл, характеризующихся тонким юмором и неожиданными развязками.')
name=input("Место рождения: Гринсборо, Северная Каролина, США")
a=input("Год рождения: 11 сентября 1862")
b=input("Год смерти: 5 июня 1910")
c=input("Возраст: на момент 47")
d=input("Область интересов: литература, юмор, рассказы")

input("\nНажмите Enter для завершения")
