#Задача 2. Вариант 10.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Юстиниан. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
 
#Donkor А. Х.

#31.03.2016

print("Является престуnлением, когда один человек строит козни другому.\n\n\n\t\t\t\t\t\t\t Юстиниан")

input("\n\n\nНажмите Enter для завершения") 
