# Задача 2. Вариант 15.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Плутарх. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Mochalov V. V.
# 02.03.2016

print("Два основных достояния человеческой природы - это ум и рассуждения.")
print("                                                           Плутарх.")

input("\n\nНажмите Enter для выхода.")
