# Задача 1. Вариант 15.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Аркадий Петрович Голиков. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Mochalov V. V.
# 02.03.2016

print("Писатель Аркадий Петрович Голиков скрывался под псевдонимом Гайдар.")

input("\n\nНажмите Enter для выхода.")
