# Задача 3. Вариант 15.
# Напишите программу, которая выводит имя "Лариса Петровна Косач-Квитка", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Mochalov V. V.
# 02.03.2016

print("Лариса Петровна Косач-Квитка")
psev=input("Введите ее псевдоним:")
print("Лариса-"+ psev +" Петровна Косач-Квитка")

input("\n\nНажмите Enter для выхода.")
