# Задача 3. Вариант 45
# Напишите программу, которая выводит имя "Мартин Андерсен", и запрашивает его
# псевдоним. Программа должна сцеплять две эти строки и выводить полученную
# строку, разделяя имя и псевдоним с помощью тире.

# Goman D.V.
# 29.03.2016

print ('Мартин Андерсен')
nik = input ('Напишите его псевдоним: ')
print ('Мартин Андерсен - '+ nik)
input ('\nВведите Enter для выхода.')
