# Задача 3. Вариант 28.
# Напишите программу, которая выводит имя "Анри Мари Бейль", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Cherniy F. Y.
# 28.02.2016

print ("Под каким псевдонимом наиболее известен Мари-Анри Бейль?")
answer = input ("Ваш ответ: ")
print ("Верно: Мари-Анри Бейль - "+answer)

input("\nДля выхода нажмите Enter")