# Задача 2. Вариант 23
#Напишите программу, которая выводит имя "София Шиколоне", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
# Сароквашин Максим 
# 25.02.2016

print ("Под каким псевдонимом наиболее известена София Шиколоне?")
answer = input ("Ваш ответ: ")
print ("Верно:София Шиколоне - "+answer)

input("\nДля выхода нажмите Enter")
