# Задача 1. Вариант 23
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Конрад Джозеф Английский писатель Юзеф Теодор Конрад Коженевский. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Сароквашин Максим 
# 23.02.2016
print ("Конрад Джозеф Английский  английский писатель. Поляк по происхождению, он получил признание как классик английской литературы,более известен как Теодор Юзеф Конрад Коженёвский ")

input ("Нажмите Enter для выхода.")
