# Задача 2. Вариант 23
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Наполеон Бонапарт. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Сароквашин Максим 
# 23.02.2016

print ("Сначала нужно ввязаться в серьезный бой, а там уже видно будет.")
print ("\t\t\t\t\t\tНаполеон Бонапарт\n")

input ("Нажмите Enter для выхода.")
