#Задача N1. Вариант 6
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Йоханнес Бруфельдт.
#После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Будашов Андрей
#03.03.2016

print("Йоханесс Бруфельд (имеет псевдоним Ахо Юхани) - финский писатель, журналист, переводчик")
input ("Press Enter to close")