#Задача N1. Вариант 8
#Напишите программу, которая будет выводить на экран наиболее понравившееся 
#вам высказывание, автором которого является Стендаль. Не забудьте о том, что
#автор должен быть упомянут на отдельной строке.
#Будашов Андрей
#03.03.2016

print("Корабль жизни поддается всем ветрам и бурям, если не имеет трудового балласта\n"+ "\t\t\t\t\t\t\t\t Стендаль")
input("Press Enter to close")
