# Задача 4. Вариант 30.
# Напишите программу, которая выводит имя, под которым скрывается Вильгельм
# Аполлинарий Костровицкий. Дополнительно необходимо вывести область
# интересов указанной личности, место рождения, годы рождения и смерти (если
# человек умер), вычислить возраст на данный момент (или момент смерти). После
# вывода информации программа должна дожидаться пока пользователь нажмет
# Enter для выхода.

# Khasanova I. F.
# 17.03.2016
print("Вильгельм Аполлинарий Костровицкий более известен, как французский поэт Гийом Аполлинер.")

year_of_birth = 1880 
date_of_death = 1918
birthplace = "Рим"
interess = "Проза и поэзия"

print("Место рождения:", birthplace)
print("Год рождения:", year_of_birth)
print("Дата смерти: ", date_of_death)
print("Область интересов: ", interess)

input("\n\nНажмите Enter для выхода.")
