# Задача 1. Вариант 30.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Симона Руссель. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Khasanova I. F.
# 15.03.2016

print("Симона Руссель более известена, как французская актриса Морган Мишель.")

input("\n\nНажмите Enter для выхода.")
