# Задача 2. Вариант 30.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Али ибн Абу Талиб. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Khasanova I. F.
# 17.03.2016

print("Пусть дурной и хороший человек не будут для тебя равны. Иначе, хороший может потерять желание делать благие дела, а дурной будет поощрен на совершение низких поступков.")

print("\n\t\t\t\t\t\t\tАли ибн Абу Талиб")

input("\n\nНажмите Enter для выхода.")
