# Задача 1, Вариант 12 
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Мария Луиза Чеччарелли. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выходае.

# Мамедов Р.А.
# 02.03.2016
print('Мария Луиза Чеччарелли итальянская актриса, её псевдоним Моника Витти') 
input("Нажмите Enter для выхода")