# Задача 1. Вариант 45
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Михаил Евграфович Салтыков. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.


# Зябко Антон
print("Михаил Евграфович Салтыкоов-Щедриин (настоящая фамилия Салтыков) был известен под  псевдонимом Николай Щедрин.")
input("\n\nНажмите Enter для выхода.")