#Задача 5 ,Вариант 45.
#Напишите программу, которая бы при запуске случайным образом отображала имя одного из четырех черепашек-ниндзя.


#Зябко Антон
#20.05.2016


import random
print("Кто ты из черепашек-ниндзя")
a=["Ты-Рафаэль","Ты-Донателло","Ты-Леонардо","Ты-Микелянджело"]
print(random.choice(a))
input ("Нажмите Enter для выхода.")
