# Задача 2. Вариант 45.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Эзоп. Не забудьте о том, что автор должен быть упомянут на отдельной строке.


# Зябко Антон
# 24.03.2016
print("Легко быть смелым с безопасного расстояния.")
print("\n\t\t\t\t\t Эзоп")
input("нажимте Enter для выхода")