# Задача № 4. Вариант 45
# Напишите программу, которая выводит имя, под которым скрывается Борис Николаевич Кампов. 

# Зябко Антон 
#13. 04. 2016

print("Борис Николаевич Кампов, более известный под фамилией Полевой")
oblinter="Любил природу"
mrozh="Москва,Россия"
msmert="Так же в Москве"
vzhizni=1908-1981
print("Область интересов: "+oblinter)
print("Место рождения: "+mrozh)
print("Место смерти: "+msmert)
print("Возраст: "+str(vzhizni))


input("\n\nНажмите Enter для выхода.")