# Задача 3. Вариант 3.
# Напишите программу, которая выводит имя "Чарльз Лютвидж Доджсон",
# и запрашивает его псевдоним. 
# Программа должна сцеплять две эти строки и выводить полученную строку,
# разделяя имя и псевдоним с помощью тире.
NAME = "Чарльз Лютвидж Доджсон"
print(NAME)
PNAME = input("Его псевдоним?\n")
print(NAME + " - " + PNAME)
inp = input()
# KAKURKIN I.V.
# 29.02.2016
