# Задача 2. Вариант 3.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам
# высказывание, автором которого является Нострадамус.
# Не забудьте о том, что автор должен быть упомянут на отдельной строке.
S = "Жизнь - это череда выборов.\n\n"
Auth = "\t\tНострадамус"
print(S,Auth)
inp = input()
# KAKURKIN I.V.
# 29.02.2015
