# Задача 1. Вариант 3.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Вильгельм Аполлинарий Костровицкий.
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
print("Вильгельм Аполлинарий Костровицкий - Французский писатель известный под псевдонимом - Гийом Аполлинер")
inp = input()
# KAKURKIN I.V.
# 29.02.2015
