# Задача №1. Вариант 6.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Йоханнес Бруфельдт. 
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Куманков Г. А.
# 17.03.2016
print('Йоханнес Бруфельдт, более известен, как журналист, переводчик, Первый профессиональный писатель Финляндии. Автор произведения "Железная дорога"(1884) и "Юха"(1911)')
input('Нажмите Enter для выхода')