# Задача 3. Вариант 10.
# Напишите программу, которая выводит имя "Игорь Васильевич Лотарев", и
# запрашивает его псевдоним. Программа должна сцеплять две эти строки и
# выводить полученную строку, разделяя имя и псевдоним с помощью тире.
# Колеганов Никита Сергеевич
# 29.05.2012

name=input("Герой нашей программы - Игорь Васильевич Лотарев.\nПод каким же именем мы знаем этого человека?")
print("Ваш ответ:", name)
print("Все верно: Игорь Васильевич Лотарев -", name)
input("\n\nНажмите Enter для выхода.")
