# Задача 2. Вариант 10.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам
# высказывание, автором которого является Юстиниан. Не забудьте о том, что
# автор должен быть упомянут на отдельной строке.
# Колеганов Никита Сергеевич
# 29.05.2016

print("Весьма несправедливо не принимать подарков ни у кого, но очень скверно брать жадно все.")
print("\n\t\tЮстиниан")
input("\n\nНажмите Enter для выхода.")
