# Задача 1. Вариант 10.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Ричард Дженкинс. После вывода информации программа должна
# дожидаться пока пользователь нажмет Enter для выхода.
# Колеганов Никита Сергеевич
# 29.05.2016

print("Ричард Дженкинс извествен по имени Ричард Дейл. Американсикй актер кино, театра и телевидения")
input("\n\nНажмите Enter для выхода.")
