# Задача 3. Вариант 20.
#Напишите программу, которая выводит имя "Мария Магдалена фон Лош", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
# Рожко Ксения
# 23.05.2016


print ("Под каким псевдонимом наиболее известена Мария Магдалена фон Лош?")
answer = input ("Ваш ответ: ")
print ("Верно:Марлен Дитрих - "+answer)

input("\nДля выхода нажмите Enter")
