#Задача 2. Вариант 3
#Программа, выводящая любимое высказывание, автором которого является Нострадамус

#Байбулатова К.В.
#13.03.2016
print("Жизнь - это череда выборов\n")
print("\t\t\t\t\t\t\t\t\tt\t\t\t Нострадамус\n")
input(" Нажмите Enter для выхода")
