#Задача3. Вариант 3
#Программа, которая выводит имя "Чарльз Лютвидж Доджсон", и запрашивает его псевдоним.

#Байбулатова К.В.
#13.03.2016

print("Герой нашей сегодняшней программы- Чарльз Лютвидж Доджсон")
psev=input("Под каким же псевдонимом он известен? Ваш ответ:")
if(psev)==("Льюис Кэрролл"):
		print("Все верно: Чарльз Лютвидж Доджсон -" +psev)
else:
		print("Вы ошиблись")
input("Нажмите Enter для выхода")	
