#Задача 1. Вариант 3.
#Программа, которая сообщает род деятельности и псевдоним под которым скрывается Вильгельм Аполлинарий Костровский.

#Байбулатова К.В.
#13.03.2016

print("Гийом Аполлинер,французский поэт, один из наиболее влиятельных деятелей европейского авангарда начала XX века\n")

input(" Нажмите Enter для выхода")
