#Задача 5. Вариант 46
#Напишите программу, которая бы при запуске случайным образом отображала
#имя одного из семи мишек Гамми.


#Gryadin V. D.

import random
a = random.choice(['Колдун Гамми.','Ворчун Гамми.','Бабушка Гамми.', 'Толстун Гамми.', 'Солнышко Гамми.', 'Малыш Гамми.', 'Густо Гамми.'])
print(a)
input("\nВведите Enter для завершения")
