#Задача 2. Вариант 46
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание,
#автором которого является Абу-ль-Фарадж бин Харун.
#Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Gryadin V. D.

print("Пьянство-мать всех пороков.")
print("\n   Абу-ль-Фарадж бин Харун")
input("\n\nНажмите Enter для завершения")
