#Задача 1. Вариант 46
#Напишите программу, которая будет сообщать род деятельности и псевдоним
#под которым скрывается Франсуаза Сориа. После вывода информации программа
#должна дожидаться пока пользователь нажмет Enter для выхода.


#Gryadin V. D.

print("Франсуа́за Юди́т Сорья́ Дрейфус более известна, как одна из самых популярных французских киноактрис - Ану́к Эме́   ")
input("\n\nНажмите Enter для выхода.")
