#Задача 3. Вариант 46
#Напишите программу, которая выводит имя "Аврора Жюпен", и запрашивает его псевдоним.
#Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя
#и псевдоним с помощью тире.

#Gryadin V. D.

print("Аврора Жюпен")
a = "Под каким же именем мы знаем этого человека?"
input(a + 'Ваш ответ: ')
print("Все верно: Аврора Жюпен - Жорж")
input("\n\nНажмите Enter для выхода.")
