# Задача 2 Вариант 39
# Текст задачи Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Гомер. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Короткова Д.С.
# 05.03.2016

print("Женщину украшает молчание.")
print("\t\t\t\t\t\t\t\t\t\t\t\t\t\tГомер")

input("нажмите enter для выхода")
