# Задача 1. Вариант 39.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Игорь Васильевич Лотарев. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Korotkova D.S.
# 26_02_2016
print("Игорь Васильевч Лотарев известен как , Игорь Северянин-русский поэт")

input("для выхода нажмте Enter")
