#Задача №4. Вариант 25.
"""Напишите программу, которая выводит имя, под которым скрывается Мэри Анн Эванс. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода."""

#Serdechnaya A.M.
#25.04.2016
print("Мэри Анн Эванс более известна,как английская писательница Джордж Элиот")
m = "Имение Арбери в графстве Уорикшир"
g = "1819 - 1880"
v = 61
o = "Писательница"
print("Место рождения: " + m)
print("Год рождения: " + g)
print("Возраст: " , v)
print("Область интересов: " + o)
input("\n\nНажмите Enter для выхода")

