# Задача 3, Вариант 2 
# Напишите программу, которая выводит имя "Мария Луиза Чеччарелли", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Андреев Ф.И.
# 23.05.2016

name = "Мария Луиза Чеччарелли"
print("Сегодня у нас в гостях - " + name)
name2 = input("Какой псевдоним у этого человека? Ваш ответ: ")
print("Все верно: " + name + " - " + name2)
input("Нажмите Enter для выхода")





