# Задача 1, Вариант 2 
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Мартин Андерсен. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Андреев Ф.И.
# 23.05.2016
print('Мартин Андерсен известный датский писатель-коммунист, его псевдоним Нексе')
input("Нажмите Enter для выхода")
