# Задача 2, Вариант 2 
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Эсхин. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Андреев Ф.И.
# 23.05.2016

print (''' Речи благородного человека, даже если они составлены коряво и безыскусно, будут полезны для слушателей, тогда как речи мерзавца не принесут слушателям никакой пользы.
 \t\t Эсхин''')
input ('Нажмите Enter для выхода')
