#Задача № 3, Вариант 21
#Напишите программу, которая выводит имя "Аркадий Петрович Голиков", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
#Rotkin A.M.
#29.05.2016
print("Введите псевдоним Аркадия Петровича Голикова:" ')
RN= "Аркадий Петрович Голиков"
vopros= input()
print (RN+" - Это "+vopros)
input ("Намжите Enter для выхода.")
