#Задача №, Вариант 21
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Михаил Николаевич Румянцев. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Rotkin A.M.
#03.03.2016
name = "Михаил Николаевич Румянцев"
psevdoname = "Карандаш"
RD = "Советский клоун"
print (RD,",", name,"," "более известен под псевдонимом" , psevdoname)
input ("Press Enter to exit")
