# Задача 4. Вариант 21.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Эдсон Арантис ду Насименту. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Rotkin A. M.
# 23.04.2016
name = "Филип Ауреол Теофраст Бомбаст фон Гогенгейм"
print (name ,"более известен как Парацельс")
interes= "Врач"
print ("Интересы:", interes)
MR = "Округ Цюриха"
print ("Место рождения:", MR)
DR = 1493
print ("Дата рождения:",DR)
DD = 1541
print ("Дата смерти:", DD)
kek = DD - DR
input ("Для получения возраста смерти нажмите Enter.")
print ("Он умер в", kek)
input ("Нажмите Enter для выхода.")
