# Задача 5. Вариант 21.
# Напишите программу, которая бы при запуске случайным образом отображала название одной из двадцати восьми стран, входящих в Европейский союз

# Rotkin A.M.
# 05.04.2016
import random
a = ("Австрия", "Бельгия", "Великобритания", "Венгрия", "Германия","Греция", "Дания","Ирландия", "Испания", "Италия","Кипр","Латвия","Литва"," Люксембург", "Мальта","Нидерланды","Польша", "Словакия","Словения", "Португалия","Румыния","Финляндия","Франция","Хорватия","Чехия","Швеция","Эстония")
b = random.choice(a)
print (b)
input ("Put Enter")
