# Задача 2. Вариант 21.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Леонардо да Винчи. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Rotkin A.M.
# 02.04.2016
print ('За сладкое приходтся горько расплачиваться')
print ("\nЛеонардо да Винчи")
input ("Нажмите Enter для выхода")
