# Задача 3. Вариант 27.
# Напишите программу, которая выводит имя "Михаил Евграфович Салтыков", и
#запрашивает его псевдоним. Программа должна сцеплять две эти строки и
#выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Denisenko A. N.
# 02.06.2016

name = "Михаил Евграфович Салтыков"
print(name)
psevdonim = input("Введите псевдоним: ")
print (name, " - ", psevdonim)
input("\n\nВведите ENTER для выхода")
