# Задача 1. Вариант 27.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
#которым скрывается Жан Батист Поклен. После вывода информации программа
#должна дожидаться пока пользователь нажмет Enter для выхода.
# Denisenko A. N.
# 02.06.2016

print ("Жан Батист Поклен, более известный  как Мольер - французский комедиограф")
input("\n\nНажмите Enter для выхода.")
