# Задача 2. Вариант 27.
# Напишите программу, которая будет выводить на экран наиболее понравившееся
#вам высказывание, автором которого является Овидий. Не забудьте о том, что
#автор должен быть упомянут на отдельной строке.

# Denisenko A. N.
# 02.06.2016

print("Все изменяется, ничто не исчезает")
print("\t\t\tОвидий")
input("\n\nНажмите Enter для выхода.")
