# Задача №1 Вариант 47
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
которым скрывается Мэри Анн Эванс. После вывода информации программа
должна дожидаться пока пользователь нажмет Enter для выход

# Golushko V. V.
# 30.05.2016

print("Мэри Анн Эванс более известна как Дордж Элиот" )
input("Для выхода нажмите enter")