# Задача 3. Вариант 22.
# Напишите программу, которая выводит имя "Филип Ауреол Теофраст Бомбаст фон
# Гогенгейм", и запрашивает его псевдоним. Программа должна сцеплять две эти
# строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Щербаков Р.А.
# 22.05.2016

name="Филип Ауреол Теофраст Бомбаст фон Гогенгейм"
print("Какой псевдоним носил швейцарский алхимик "+name+"?")
answer=input("Ваш ответ: ");
input("Правильно: "+name+" - "+answer+"\n\nEnter.")
