# Задача 2. Вариант 21.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Леонардо да Винчи. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Platonova O. A.
# 29.05.2016

print("Истина была единственной дочерью времени.\n\t\t\t\t\t\tЛеонардо да Винчи")
input("\n\nНажмите Enter для выхода.")
