# Задача 3. Вариант 21.
#Напишите программу, которая выводит имя "Аркадий Петрович Голиков", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Platonova O. A.
# 29.05.2016

print("Аркадий Петрович Голиков.")
psevdo=input("Введите его псевдоним.\n")
print("Аркадий Петрович Голиков - "+psevdo)
input("\nНажмите Enter для выхода.")
