# Задача 1. Вариант 21.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Михаил Николаевич Румянцев. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Platonova O. A.
# 29.05.2016

print("Михаил Николаевич Румянцев более известен, как клоун Карандаш.")
input("\n\nНажмите Enter для выхода.")