#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Борис Николаевич Бугаев. 
#После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.


# Кодзоков М.М., 25.05.2016
print ("Борис Николаевич Бугаев - Русский писатель, поэт, критик, мемуарист, стиховед;\nOдин из ведущих деятелей русского символизма и модернизма в целом")
input("Нажмите ENTER для продолжения")
