#задача1 вариант 34
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Борис Николаевич Кампов. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.


#Белова Мария
#21.04.16


print ("Борис Николаевич Полевой (настоящая фамилия Кампов), русский советский журналист и прозаик")
input ("\n\nнажмите enter для выхода")