# Задача 1. Вариант 18.
# Текст задачи: Напишите программу, которая будет сообщать род деятельности и псевдоним под 
#               которым скрывается Мария Магдалена фон Лош. 
#               После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# F I.O. Перевощиков Владислав Андреевич
# DATE_LAST_UPDATE 21/02/16
print("Мария Магдалена Дитрих фон Лош более известна, как немецкая и американская киноактриса, певица Марлен Дитрих.")
input("Для продолжения нажмите ENTER.")