# Задача 1. Вариант 22.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Михаил Ефимович Фрилянд. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Titov S.G.
# 14.03.2016

print ("Михаил Ефимович Фридлянд (псевдоним Мигель Мартинес) - советский публицист, журналист, писатель, общественный деятель.")

input ("\nНажмите Enter для выхода.")
