# Задача 2. Вариант 22.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Демокрит. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Titov S.G.
# 14.03.2016

print ("Свободным я считаю того, кто ни на что не надеется и ничего не боится.")
print ("\n\t\t\t\t\t\t\t\tДемокрит.")

input ("\nНажмите Enter для выхода.")
