# Задача 2. Вариант 7.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Стендаль. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Krasnikov A. S.
# 19.03.2016
print("Будем трудиться, потому что труд - это отец удовольствия.")
print("\n\n                                             Cтендаль")
input("\n\nНажмите Enter для выхода.")