# Задача 3. Вариант 7.
#Напишите программу, которая выводит имя "Мэри Анн Эванс", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
# Krasnikov A. S.
# 19.03.2016
print("Герой нашей сегоднящней программы - Мэри Анн Эванс")
print("Под каким же именем мы знаем этого человека? Ваш ответ:")
real_name="Всё верно: Мэри Анн Эванс"
answer= input()
print(real_name+" - "+answer)
input("\n\nНажмите Enter для выхода.")