# Задача 1. Вариант 0.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Эдуард Георгиевич Зюбин. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Krasnikov A. S.
# 14.03.2016

print("Псевдоним Багрицкий Эдуард - поэт, писатель,настоящее имя Эдуард Георгиевич Зюбин. ")

input("\n\nНажмите Enter для выхода.")