#Задача 1. Вариант 22
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Михаил Ефимович Фридлянд. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Rudich A.C.
#09.02.2016
print("Михаил Ефимович Фридлянд более известена, как русский, советский писатель Михаил Кольцов")
input('\nНажмите Enter для выхода')