#Задача 2. Вариант 22
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Демокрит. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Rudich A.C.
#23.02.2016
print("<<Раскаяние в постыдных делах есть спасение жизни.>>")
print("\t\t\tДемокрит")
input('\n\nНажмите Enter для выхода')