#Задача 4. Вариант 22
#Напишите программу, которая выводит имя, под которым скрывается Самюэл Ленгхорн Клеменс. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Rudich A.C.
#21.03.2016
print("Самюэл Ленгхорн Клеменс более известен, как американский писатель, журналист и общественный деятель Марк Твен")
m = 'Флорида, Миссури, США'
g = 1835
d = 1910
v = 74
o = 'Прозаик, Журналист, Публицист'
print("Место рождения: " + m)
print("Год рождения: ", g)
print("Год сммерти: ", d)
print("Возраст: ", v)
print("Область интересов: " + o)
input("\nНажмите Enter для выхода")