#Задача 3. Вариант 22
#Напишите программу, которая выводит имя "Филип Ауреол Теофраст Бомбаст фон Гогенгейм", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

#Rudich A.C.
#08.03.2016
print("Сегодня речь пойдёт про Филипа Ауреола Теофраста Бомбаста фон Гогенгейма")
print("Под каким именем мы знаем этого человека?"); print("Ваш ответ: Парацельс")
print("Всё верно: Филип Ауреол Теофраст Бомбаст фон Гогенгейм - Парацельс")
input('\nНажмите Enter для выхода')