# Задача 1. Вариант 48.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Доменико Теотокопули. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Vinogradova J. 
# 15.03.2016

print("Доменико Теотокопули более известен, как  испанский художник Эль Греко.")

input("\n\nНажмите Enter для выхода.")
