# Задача 2. Вариант 48.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Софокл. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Vinogradova J. 
# 17.03.2016

print("Ум, несомненно, первое условие для счастья.")

print("\n\t\t\t\t\t\t\tСофокл")

input("\n\nНажмите Enter для выхода.")
