# Задача 4. Вариант 48.
# Напишите программу, которая выводит имя, под которым скрывается Герхард Герхардс. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер),
# вычислить возраст на данный момент (или момент смерти). Для хранения всех
# необходимых данных требуется использовать переменные. После вывода
# информации программа должна дожидаться пока пользователь нажмет Enter для
# выхода.

# Vinogradova J. 
# 17.03.2016
print("Герхард Герхардс более известен, как филолог, писатель Эразм Роттердамский.")

year_of_birth = 1469 
date_of_death = 1536
birthplace = "Роттердам"
interess = "Проза и поэзия"

print("Место рождения:", birthplace)
print("Год рождения:", year_of_birth)
print("Дата смерти: ", date_of_death)
print("Область интересов: ", interess)

input("\n\nНажмите Enter для выхода.")
