# Задача 2. Вариант 30.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Али ибн Абу Талиб.
# Shemenev A.V
# 14.03.16
print("Люди нуждаются в воспитанности больше, чем в науке.")
print("\t\t\t\t Али ибн Абу Талиб") 
input()


