# Задача 1. Вариант 30.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Симона Руссель. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Shemenev A.V
# 29.02.16


print("Симоне Рассел является вымышленный персонаж на американской мыльной оперы Страсти")
input("Click Enter")

