Напишите программу, которая выводит имя, под которым скрывается Михаил
Ефимович Фрилянд. Дополнительно необходимо вывести область интересов
указанной личности, место рождения, годы рождения и смерти (если человек
умер), вычислить возраст на данный момент (или момент смерти). Для хранения
всех необходимых данных требуется использовать переменные. После вывода
информации программа должна дожидаться пока пользователь нажмет Enter для
выхода.

name = "Михаил Ефимович Кольцов"
 birthplace = " Киев"
 birthyear = int (1898)
 deathyear = int (1940)
 age = int (deathyear - birthyear)
 interest = "журналистика"
 
 print(name+"  настоящее имя — Мойсей Фридлянд, псевдоним в Испании — Мигель Мартинес,советский публицист и журналист, писатель, общественный деятель. Член-корреспондент АН СССР.")
 print("Место рождения: "+birthplace)
 print("Год рождения: "+str(birthyear))
 print("Год смерти: "+str(deathyear))
 print("Возраст смерти: "+str(age))
 print("Область интересов: "+interest)
 
 input("\nДля выхода нажмите Enter")


Напишите программу, которая бы при запуске случайным образом отображала
имя одного из двенадцати апостолов.



import random
 
print ("Программа случайным образом отображает имя одного из двенадцати апостолов.")
 
 x = int (random.randint(1,4))
 
 print ('\nОдин из основателей - ', end = '')
 
 if x == 1:
     print ('Иуда.')
 elif x == 2:
     print ('Пётр.')
 elif x == 3:
     print ('Иоанн.')
elif x == 4:
     print ('Иаков Зеведеев.')
elif x == 5:
     print ('Филипп.')
elif x == 6:
     print ('Варфоломей.')
elif x == 7:
     print ('Матфей.')
elif x == 8:
     print ('Фома.')
elif x == 9:
     print ('Иаков Алфеев.')
elif x == 10:
     print ('Фаддей.')
elif x == 11:
     print ('Симон Канани.')
 else:
     print ('Андрей.')

     
 input("\nДля выхода нажмите Enter.") 



Создайте игру, в которой компьютер загадывает название одного из двух
спутников Марса, а игрок должен его угадать.

import random
cvet = random.randint(1,2)
if sputnik == 1: sputnik="фобос"
elif sputnik ==2: sputnik="деймес"

print("Угадай спутник Марса: ")
otvet = input("\n ВВеди слово: ")
while(otvet != cvet):
    print("\nНеправильно. Попробуй еще раз")
    otvet = input("\nВведи слово: ")
 
print("Правильно! Это", sputnik,"спутник!")
input("Нажмите ENTER для продолжения")







import random

print("Компьютер загадал марку одной из машин.\n")

car = ('chevralet','honda','mitsubishi','dodge','bmw','mercedes')
car = random.randint(0,5)
x = 0
i = 0
score = 0

#print (car[0]\n,car[1]\n,car[2]\n,car[3]\n,car[4]\n,car[5])

while(x != 6):
	print(auto[x])
	x += 1

answer = input("\nВведите название автомобиля: ")

while(answer != cars[car]):
    print("Неверно, попробуйте ещё раз.")
    answer = input("\n Введите название автомобиля: ")
    i += 1

if i == 0:
	score = 100
	
elif 0<i<6:
	score = 100 - i*2
	
else:
	score = 0

print("Верно, Вы победили!")
print("Число попыток: "+str(i))
print("Вы заработали "+str(score)+" баллов")

input("\nДля выхода нажмите Enter.")





import random
words = ("класс", "биржа", "кинотеатр", "продукты", "стелс")
word = random.choice(words)
proverka = word
letters = len(word)
letter = random.randrange(letters)
i = 4
print("Я загадал некоторое слово на русском языке. В нём ", letters, " букв(/-ы).")
print("У Вас есть 5 попыток угадать буквы в этом слове!")
guess = input("Введите букву: ")
while i > 0:
	if guess in word:
		print("Есть такая буква!")
	else: print("Такой буквы нет, пробуйте еще!")
	i -= 1
	guess = input("Введите ещё одну букву: ")
guess = input("Назовёте слово целиком?  ")
if guess == word:
	print("Всё верно! Это слово", word)
else:
	print("ты пытался((...")
input ("\nНажмите Enter для выхода.")






