# Задача 3. Вариант 47
# Напишите программу, которая выводит имя, и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Dubs A. E.
# 14.04.2016

print ("Герой нашей сегодняшней программы - Герхард Герхардс") 
input ("\n Под каким же именем мы знаем этого человека? Ваш ответ: Эразм Роттердамскиий")
print ("\n Все верно: Герхард Герхардс - Эразм Роттердамскиий")

input ("\n\nНажмите Enter для выхода.")