# Задача 2. Вариант 47
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Александра Маринина. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Dubs A. E.
# 14.04.2016

print ("Чем человек старше и мудрее, тем яснее он понимает, что смысл жизни только в том, чтобы быть кому-то нужным.")

print ("\n\n\n\t\t\tАлександра Маринина.")

input ("\n\nНажмите Enter для выхода.")
