# Задача 4. Вариант 47
# Напишите программу, которая выводит имя, под которым скрывается Аврора Жюпен. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода

# Dubs A. E.
# 14.04.2016

print ("Аврора Дюпен более известна, как писательница Жорж Санд")
print ("\n Место рождения: Париж, Франция")
print ("\n Год рождения: "  + "1804")
print ("\n Дата смерти: " + "1876")
print ("\n Возраст: " + "72")
print ("\n Область интересов: писательство")

input ("\n\n Нажмите Enter для выхода.")