# Задача 3. Вариант 8.
# Напишите программу, которая выводит имя "Борис Николаевич Бугаев", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Ionova A.K.
# 30.04.2016

print ("Под каким псевдонимом наиболее известен Борис Николаевич Бугаев?")
answer = input ("Ваш ответ: ")
print ("Верно: Андрей Белый - "+answer)

input("\nДля выхода нажмите Enter") 