 # Задача 2. Вариант 8.
 #Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Лао-Цзы. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
 
 # Ionova A. K.
 #30.04.2016
 
 print("Нельзя обожествлять бесов.\n\t\t\t\t\t\t\t\tЛао-цзы")
 input("Нажмите ENTER для выхода.")