# Задача 1. Вариант 41.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Самюэл Ленгхорн Клеменс. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Korotkowa D. E.
# 07.04.2016

print("Самюэл Ленгхорн Клеменс более известен, как  американский писатель Марк Твен.")

input("\n\nНажмите Enter для выхода.")