# Задача 2. Вариант 41.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Мольер. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Korotkowa D. E.
# 08.04.2016

print("Крепнет нравственность, когда дряхлеет плоть.")

input("\n\nНажмите Enter для выхода.")