# Задание 5, вариант 32
# Напишите программу, которая бы при запуске случайным образом отображала имя одного из шестнадцати официальных чемпионов Мира по шахматам..
# Ширлин Вячеслав Викторович
# 24.03.2016
import random
print("Программа случайным образом отображает имя одного из шестнадцати официальных чемпионов Мира по шахматам.  \n\n"+ random.choice (['Михаил Таль']))
input ("Нажмите Enter для выхода.")
