# Задача 4. Вариант 32
# Напишите программу, которая выводит имя, под которым скрывается Конрад Джозеф. 
#Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). 
#Для хранения всех необходимых данных требуется использовать переменные.
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Ширлин Вячеслав Викторович
# 24.03.16

print("Конрад Джозеф  более известна, как Юзеф Теодор Конрад Коженевский")
live = " Бердичев, Киевская губерния"
print ("Место рождения:" + live)
year= "1857"
print ("Год рождения:" + year)
age= "66"
print ("Возраст:" + age ) 
interes= " писатель"
print ("Область интересов:" + interes)
input("Нажмите ENTER для выхода.")