#Задание 1. Вариант 32
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Уильям Сидни Портер. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Ширлин Вячеслав Викторович
#10.03.2016
print("Уильям Сидни Портер-литературный псевдоним О. Генри, американский писатель, прозаик, автор популярных новелл.")
input("Нажмите Enter для выхода из программы")