#Задание 3. Вариант 32
#Напишите программу, которая выводит имя "Фредерик Аустерлиц", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
#Ширлин Вячеслав Викторович 
#10.03.2016

print("Герой нашей сегоднешней программы - Фредерик Аустерлиц")
print("Под каким же именем мы знаем этого человека? Ваш ответ: Фред Астер")
print("Все верно: Фредерик Аустерлиц - Фред Астер")
input("Нажмите Enter для выхода из программы")
