#Задание 2. Вариант 32
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Омар Хайям. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
#Ширлин Вячеслав Викторович 
#10.03.2016
print(" Будь весел! Не навек твоя пора-Пройдёт сегодня, как прошло вчера \n \t \t \t \t Омар Хайям")
input("Нажмите Enter для выхода из программы")