#задача 1. Вариант 29
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Джебран Халиль Джебран. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Чинкиров В.В
#29.02.2016

print("Под псевдонимом Джебран Халиль ,скрывается ливанский философ Джебран Халиль Джебран ")
print("Значимость человека определяется не тем, чего он достиг, а скорее тем, чего он дерзает достичь.-Джебран Халиль")

input("Нажмите Enter")
