#задача 1. Вариант 29
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Иво Ливи. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Чинкиров В.В
#19.02.2016
print("Под псевдонимом Иво Ливи ,скрывается француский певец Ив Монтант")
input("Нажмите Enter")

