
# Задача 2. Вариант 50.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, 
#автором которого является Иларион (Алфеев).
#Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Alekseev I.S.
# 15.05.2016

print("Так и совершилось. Ибо вера благодатная распростерлась по всей земле и достигла нашего народа русского.\nИ озеро закона пересохло, евангельский же источник, исполнившись водой и покрыв всю землю, разлился и до пределов наших.")

print("\n\t\t\t\t\tИларион (Алфеев)")

input("\n\nНажмите Enter для выхода.")
