# Задача 3. Вариант 50.
# Напишите программу, которая выводит имя "Саид-Мурадзола Садриддин", и запрашивает его псевдоним. 
#Программа должна сцеплять две эти строки и выводить полученную строку,
#разделяя имя и псевдоним с помощью тире.

# Alekseev I.S.
# 15.05.2016

name = "Саид-Мурадзола Садриддин"
print("Герой нашей сегоднящней программы - " + name)
alias = input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
#вводим Айни
print("Все верно: " + name + " - " + alias)

input("\n\nНажмите Enter для выхода.")
