# Задача 1. Вариант 50.
# Напишите программу, которая будет сообщать род деятельности и псевдоним 
#под которым скрывается Герхард Герхардс. После вывода информации программа 
#должна дожидаться пока пользователь нажмет Enter для выхода.

# Alekseev I.S.
# 14.05.2016

print("Герхард Герхардс - нидерландский учёный-гуманист, писатель, богослов, виднейший представитель северного Возрождения.")

input("\n\nНажмите Enter для выхода.")
