#Задача №4 Вариант 9
#Программа пишет высказывание Древнегреческого философа Эпиктета

#Гасанов АФ
#14.03.2016
print('Михаил Николаевич Румянцев , советский артист цирка, более известен как Карандаш')
place='Санкт-Петербург, СССР '
born='1901'
age='82'
interes='Цирк'
print('Место рождения: '+place)
print('Год рождения: '+str(born))
print('Умер в возрасте: '+str(age))
print('Область интересов: '+interes)
input('Нажмите Enter для выхода')
