#Задача №1 Вариант 9
#Программа пишет высказывание Древнегреческого философа Эпиктета

#Гасанов АФ
#29.02.2016
print ("Если хочешь, чтобы говорили хорошо про тебя, не говори худо о других.\n" + "\t\t\t\t\t\t Эпиктет")
input("Нажмите Enter для выхода.")



