#Задача №1 Вариант 9
#Программа выводит имя и запрашивает его псевдоним

#Гасанов АФ
#29.02.2016

print ("Герой нашей сегоднящней программы - Доменико Теотокопули")
psev=input("Под каким же именем мы знаем этого человека? Ваш ответ:")
if (psev)==("Эль Греко"):
	print ("Всё верно:  - Доменико Теотокопули"+psev)
else:
	print ("Вы ошиблись, это не его псевдоним.")
input("нажмите Enter для выхода") 
