# Задача 1. Вариант 31.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Эмиль Эрзог. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Nezamov S.I.
# 31.03.2016

print(" Андре Моруа, его псевдоним Эмиль Эрзог - французский писатель")
input("нажмет Enter")
