# Задача 5. Вариант 31.
# Напишите программу, которая бы при запуске случайным образом отображала имя одного из двух братьев, создателей старославянской азбуки.
# Nezamov S.I.
# 14.04.2016

import random
brothers = ('Кирилл','Мефодий')
print(random.choice(brothers))
