# Задача 2. Вариант 31.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Иоанн Златоуст. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Nezamov S.I.
# 31.03.2016

print ("Быть близко или далеко от Бога зависит от самого человека, потому что Бог везде.")
input ("\nИоанн Златоуст")
