# Задача 3. Вариант 31.
# Напишите программу, которая выводит имя, под которым скрывается Анна Андреевна Горенко. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Nezamov S.I.
# 14.04.2016
print ("Анна Андреевна Ахматова, Домодедово, Московская область — русская поэтесса, переводчица и литературовед, одна из наиболее значимых фигур русской литературы XX века.\nДата рождения: 30 мая (11 июня) 1889\nДата смерти: 5 марта 1966[1][2] (76 лет)")
input ("")
