# Задача 3. Вариант 31.
# Напишите программу, которая выводит имя "Эмиль Эрзог", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
# Nezamov S.I.
# 14.04.2016

print ("Эмиль Эрзог -", end=' ')
input ("Андре Моруа")
