# Задача 2. Вариант 34
# Напишите программу, которая будет выводить на экран наиболее понравившееся 
# вам высказывание, автором которого является Платон. Не забудьте о том, 
# что автор должен быть упомянут на отдельной строке.

# Korsakov A.A.
# 31.03.2016

print ('\nНикто не знает, что такое смерть и не есть ли она величайшее для человека добро. И однако, все ее страшатся как бы в сознании, что она - величайшее зло.')
print ('\n\t\t Платон')
input ('\n\n Нажмите Enter для выхода')