# Задача 3. Вариант 34
# Напишите программу, которая выводит имя "Александр Михайлович Гликберг", 
# и запрашивает его псевдоним. Программа должна сцеплять две эти строки 
# и выводить полученную строку, разделяя имя и псевдоним с помощью тире. 

# Korsakov A.A.
# 31.03.2016

print ('\n Сегодня мы поговорим об Александре Михайловиче Гликберге.')
b = input('Под каким именем мы знаем этого человека? Ваш ответ:')
print('Всё верно: Александр Михайлович Гликберг -', b)


input ('\n\n Нажмите Enter для выхода')