# Задача 4. Вариант 34
# Напишите программу, которая выводит имя, под которым скрывается Мария Луиза Полякова —
# Байдарова. Дополнительно необходимо вывести область интересов указанной личности, место
# рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент
#(или момент смерти). Для хранения всех необходимых данных требуется использовать
# переменные. После вывода информации программа должна дожидаться пока пользователь
# нажмет Enter для выхода.

# Korsakov A.A.
# 31.03.2016

print ('Мария Луиза Полякова - Байдарова более известна, как Марина Влади ')
MestoRojdenia = 'Клиши-ла-Гаренн, О-де-Сен, Франция'
GodRojdenia = 1938
Vozrast = 78
OblastInteresov = 'Кинематограф, Музыка'
print('Место Рождения:', MestoRojdenia)
print('Год рождения:', GodRojdenia)
print('Возраст:', Vozrast)
print('Область интересов:', OblastInteresov)

input ('\n\n Нажмите Enter для выхода')
