# Задача 1. Вариант 27.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Жан Батист Поклен. После вывода информации программа
# должна дожидаться пока пользователь нажмет Enter для выхода.
# Чернов Михаил Сергеевич
# 28.05.2016

print("Жан Батист Поклен известен под псевдонимом Мольер. Был артистом.")
input("\n\nНажмите Enter для выхода.")
