# Задача 2. Вариант 27.
# Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Овидий. Не забудьте о том, что
# автор должен быть упомянут на отдельной строке.
# Чернов Михаил Сергеевич
# 28.05.2016

print("Верь опыту")
print("\n\t\tОвидий")
input("\n\nНажмите Enter для выхода.")
