# Задача 3. Вариант 27.
# Напишите программу, которая выводит имя "Михаил Евграфович Салтыков", и
# запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить
# полученную строку, разделяя имя и псевдоним с помощью тире.
# Чернов Михаил Сергеевич
# 28.05.2012

name=input("Герой нашей программы - Михаил Евграфович Салтыков.\nПод каким же именем мы знаем этого человека?")
print("Ваш ответ:", name)
print("Все верно: Михаил Евграфович Салтыков -", name)
input("\n\nНажмите Enter для выхода.")
