# Задача 2. Вариант 45
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам 
# высказывание, автором которого является Эзоп. Не забудьте о том, что автор
# должен быть упомянут на отдельной строке.

# Goman D.V.
# 29.03.2016


print ('Невсегда будет лето.')
print ('\n\t\tЭзоп')
input ('\n\nВведите Enter для выхода.')
