#Задача №1 Вариант 13
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Саади Ширази
#Martynov M.I.
#17.04.2016
print("МАРИНА ВЛАДИ( Екатерина Марина Владимировна де Полякова-Байдарова )-Французская актриса кино, телевидения и эстрады.")
input("Нажмите Enter для выхода.")