#Задача №4 Вариант 13
#Напишите программу, которая выводит имя, под которым скрывается Жан Батист Поклен. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). 
#Martynov M.I.
#19.04.2016

print ("Жан-Батист Поклен, театральный псевдоним-Мольер.")
place="Париж, Франция"
born="1622"
death="1673"
age="51"
interes="Театр"
print('Место рождения: '+place)
print('Год рождения: '+str(born))
print('Год смерти: '+str(death))
print('Умер в возрасте: '+str(age))
print('Область интересов: '+interes)
input("Нажмите Enter для выхода.")
