#Задача №2 Вариант 13
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Саади Ширази
#Martynov M.I.
#17.04.2016
print("Люди рождаются только с чистой природой, и лишь потом отцы делают их иудеями, христианами или огнепоклонниками.")
input("Нажмите Enter для выхода.")