#Задача №1 Вариант 9
#Программа выводит имя и запрашивает его псевдоним

#Martynov M.I.
#07.04.2016

print ("Герой нашей сегоднящней программы - Норма Бейкер")
psev=input("Под каким же именем мы знаем этого человека? Ваш ответ:")
if (psev)==("Мэрили́Н Монро́"):
	print ("Всё верно:  - Норма Бейкер"+psev)
else:
	print ("Вы ошиблись, это не его псевдоним.")
input("нажмите Enter для выхода.")