#Задача №4 , Вариант 13
#Напишите программу, которая выводит имя, под которым скрывается Жан Батист Поклен. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти).

#Костарев А. И.
#14.03.16

print ("Жан Батист Поклен более известен, как французский комедиограф, актер, театральный деятель, реформатор сценического искусства Жан Батист Мольер.")
MR= "Париж, Франция"
GR= 1622
V= 1673-1622
OI= "французский комедиограф XVII века"
print ('Место Рождения: ' + MR)
print ('Год рождения:' , GR)
print ('Возраст:' , V)
print ('Область интересов: ' + OI)
input ("Нажмите Enter для выхода.")
