# Задача 3. Вариант 22. 
# Напишите программу, которая выводит имя "Филип Ауреол Теофраст Бомбаст фон Гогенгейм", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире. 

# Nikishin P. S. 
# 14.04.2016 

name = input("Псевдоним Филипа Ауреола Теофраста Бомбасат фон Гогенгейма? ") 
print("Филип Ауреол Теофраст Бомбаст фон Гогенгейм - ",name )

input("\nДля выхода нажмите Enter") 
