# Задача 1. Вариант 22. 
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Михаил Ефимович Фридлянд. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода. 

# Nikishin P. S. 
# 14.04.2016 

print("Михаил Ефимович Фрилянд более известен, как советский публицист, журналист, писатель, общественный деятель. ") 

input("\nДля выхода нажмите Enter") 
