# Задача 2. Вариант 22. 
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Демокрит. Не забудьте о том, что автор должен быть упомянут на отдельной строке. 

# Nikishin P. S. 
# 14.04.2016 

print("Сила и красота суть блага юности, преимущество же старости — расцвет рассудительности. ") 
print("Демокрит Абдерский. ")

input("\n\nНажмите Enter для выхода.")
