#Задача 3. Вариант 33
#Напишите программу, которая выводит имя "Эжен Грендель", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

#Perepyelkov Y.A.
#08.03.2016
print("Сегодня речь пойдёт про Эжена Гренделя")
print("Под каким именем мы знаем этого человека?"); print("Ваш ответ: Поль Элюар")
print("Всё верно: Эжен Грендель - Поль Элюар")
input('\nНажмите Enter для выхода')