#Задача 2. Вариант 33
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Екатерина II. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Perepyelkov Y.A.
#23.02.2016
print("<<Победителей не судят.>>")
print("\t\t\tЕкатерина II")
input('\n\nНажмите Enter для выхода')