#Задача 1. Вариант 33
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Филип Ауреол Теофраст Бомбаст фон Гогенгейм. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Perepyelkov Y.A.
#09.02.2016
print("Филип Ауреол Теофраст Бомбаст фон Гогенгейм более известен, как швейцарский алхимик, врач, философ Парацельс")
input('\nНажмите Enter для выхода')