#Задача 4. Вариант 33
#Напишите программу, которая выводит имя, под которым скрывается Мария Магдалена фон Лош. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Perepyelkov Y.A.
#21.03.2016
print("Мария Магдалена фон Лош более известена, как немецкая и американская актриса, секс-символ и певица Марлен Дитрих")
m = 'Шёнеберг, Германская империя'
g = 1901
d = 1992
v = 90
o = 'Актёрство; Пение'
print("Место рождения: " + m)
print("Год рождения: ", g)
print("Год сммерти: ", d)
print("Возраст: ", v)
print("Область интересов: " + o)
input("\nНажмите Enter для выхода")