#Задача 4. Вариант 6.
#Напишите программу, которая выводит имя, под которым скрывается София Шиколоне. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Данилов Д.А.
#21.05.2016
gor="Италия, Рим"
god=1934
age=2016-god
inter="киноиндустрия "
print("София Виллани Шиколоне, более известна как, София Лорен.")
print("Место рождения: ",gor)
print("Год рождения: ",god)
print("Возраст на данный момент: ",age)
print("Область интересов: ",inter)
input("\n\n\nНажмите Enter для завершения")
