#Задача 4. Вариант 11.
#Напишите программу, которая выводит имя, под которым скрывается Йоханнес Бруфельдт. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Козлов А.Д.
#14.03.2016
gor="Лапинлахти, Финляндия"
god=1861
age=1921-god
age2=2016-god
inter="Литература"
print("Йоханнес Бруфельд, более известен как, Юхани Ахо.")
print("Место рождения: ",gor)
print("Год рождения: ",god)
print("Возраст на момент смерти: ",age)
print("Возраст на момент смерти: ",age2)
print("Область интересов: ",inter)
input("\n\n\nНажмите Enter для завершения")
