#Задача №4, Вариант 17
#Программа выводит имя, под которым скрывается Грета Густафсон и дополнительно выводит область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти)

#Шмирейчик С.В.
#14.03.2016



print(" Грета Густафсон более извесная, как  шведская и американская актриса Грета Гарбо.")
born=1905
death=1990
age=1990-1905
place="Стокгольм, Швеция"
interes="кино"
print("место рождения: "+(place))
print("год рождения: "+str(born))
print("возраст на момент смерти: "+str(age))
print("момент смерти: "+str(death))
print("область интересов: "+(interes))
input("Нажмите Enter для выхода.")